backend/tests/jmeter/report/statistics.json
{
  "Get Model Metrics" : {
    "transaction" : "Get Model Metrics",
    "sampleCount" : 100,
    "errorCount" : 75,
    "errorPct" : 75.0,
    "meanResTime" : 1.55,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 9.0,
    "pct1ResTime" : 2.9000000000000057,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 8.95999999999998,
    "throughput" : 10.485477613505296,
    "receivedKBytesPerSec" : 2.3963002647583096,
    "sentKBytesPerSec" : 2.0863438122575233
  },
  "Batch Prediction Request" : {
    "transaction" : "Batch Prediction Request",
    "sampleCount" : 100,
    "errorCount" : 75,
    "errorPct" : 75.0,
    "meanResTime" : 9.15,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 214.0,
    "pct1ResTime" : 8.0,
    "pct2ResTime" : 9.949999999999989,
    "pct3ResTime" : 213.5899999999998,
    "throughput" : 10.485477613505296,
    "receivedKBytesPerSec" : 3.120555959683338,
    "sentKBytesPerSec" : 3.1615148566110935
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 500,
    "errorCount" : 375,
    "errorPct" : 75.0,
    "meanResTime" : 35.58199999999999,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 544.0,
    "pct1ResTime" : 167.0,
    "pct2ResTime" : 309.499999999999,
    "pct3ResTime" : 525.7800000000002,
    "throughput" : 49.81568197668626,
    "receivedKBytesPerSec" : 13.935547847962537,
    "sentKBytesPerSec" : 12.823646258842283
  },
  "Single Prediction Request" : {
    "transaction" : "Single Prediction Request",
    "sampleCount" : 100,
    "errorCount" : 75,
    "errorPct" : 75.0,
    "meanResTime" : 4.2299999999999995,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 23.0,
    "pct1ResTime" : 12.900000000000006,
    "pct2ResTime" : 15.0,
    "pct3ResTime" : 22.969999999999985,
    "throughput" : 10.477787091366304,
    "receivedKBytesPerSec" : 2.7652558217204524,
    "sentKBytesPerSec" : 3.3024470544321036
  },
  "Train Model Request" : {
    "transaction" : "Train Model Request",
    "sampleCount" : 100,
    "errorCount" : 75,
    "errorPct" : 75.0,
    "meanResTime" : 114.99999999999997,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 544.0,
    "pct1ResTime" : 492.8,
    "pct2ResTime" : 524.8999999999997,
    "pct3ResTime" : 543.9499999999999,
    "throughput" : 10.21346134204882,
    "receivedKBytesPerSec" : 3.4611066604534777,
    "sentKBytesPerSec" : 2.4710791479419876
  },
  "Login Request" : {
    "transaction" : "Login Request",
    "sampleCount" : 100,
    "errorCount" : 75,
    "errorPct" : 75.0,
    "meanResTime" : 47.980000000000004,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 224.0,
    "pct1ResTime" : 180.0,
    "pct2ResTime" : 197.95,
    "pct3ResTime" : 223.95,
    "throughput" : 9.970089730807578,
    "receivedKBytesPerSec" : 2.6896848516949152,
    "sentKBytesPerSec" : 2.288057701894317
  }
}